# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO147 object detection model with P3/8 - P5/32 outputs
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 137 layers, 2,809,216 parameters, 2,809,200 gradients, 6.54 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 137 layers, 10,103,616 parameters, 10,103,600 gradients, 21.2 GFLOPs
  m: [0.50, 1.00, 512] # summary: 172 layers, 21,864,055 parameters, 21,864,039 gradients, 65.3 GFLOPs
  l: [1.00, 1.00, 512] # summary: 277 layers, 28,473,902 parameters, 28,473,886 gradients, 88.9 GFLOPs
  x: [1.00, 1.50, 512] # summary: 277 layers, 63,632,674 parameters, 63,632,658 gradients, 198.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, HourglassExtraDW_2, [128]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, HourglassExtraDW_2, [256]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, HourglassExtraDW_2, [512, [1.0, 0.5]]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, HourglassExtraDW_2, [1024, [1.0, 0.5]]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [[-1, 6], 1, UpsampleMerge, [512]] # Upsample and merge backbone P4
  - [-1, 2, HourglassExtraDW_2, [512]] # 12

  - [[-1, 4], 1, UpsampleMerge, [256]] # Upsample and merge backbone P3
  - [-1, 2, HourglassExtraDW_2, [256]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 2, HourglassExtraDW_2, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  # - [-1, 2, C3NX2, [1024, True]]
  - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 2, HourglassExtraDW_2, [1024, [1.0, 0.5]]] # 22 (P5/32-large)

  - [[14, 18, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
