# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO145 object detection model with P3/8 - P5/32 outputs
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 136 layers, 2,743,104 parameters, 2,743,088 gradients, 6.49 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 136 layers, 9,840,320 parameters, 9,840,304 gradients, 21.0 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3NX, [128, False]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3NX, [256, False]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3NX2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3NX2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [[-1, 6], 1, UpsampleMerge, [512]] # Upsample and merge backbone P4
  - [-1, 2, C3NX, [512, False]] # 12

  - [[-1, 4], 1, UpsampleMerge, [256]] # Upsample and merge backbone P3
  - [-1, 2, C3NX, [256, False]] # 14 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 2, C3NX, [512, False]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  # - [-1, 1, Conv, [1024, 1, 1]]
  - [-1, 2, C3NX2, [1024, True]] # 21 (P5/32-large)

  - [[14, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
